org/tools/tricks.org
#+setupfile:./hugo_setup.org
#+hugo_slug: tricks
#+title: tricks for linux system

* enable pulseaudio noise cancellation
put in /etc/pulse/default.pa:
#+begin_src sh
load-module module-echo-cancel use_master_format=1 aec_method=webrtc aec_args="analog_gain_control=0\ digital_gain_control=1" source_name=echoCancel_source sink_name=echoCancel_sink
set-default-source echoCancel_source
set-default-sink echoCancel_sink
#+end_src

* docker troubleshooting
#+begin_src sh
# remove all containers
docker rmi $(docker images -a -q)
# stop all running containers
docker stop $(docker ps -a -q)
#+end_src
